In [9]:
people = {
    "first": ["Har", 'Jonny', 'Amit', 'Naina'], 
    "last": ["Mesh", 'Harode', 'Shukla', 'Sharma'], 
    "email": ["harmesh@gmail.com", 'jonnyharode@email.com', 'amitshukla@email.com', 'Nainasharma@gmail.com']
}

In [10]:
import pandas as pd

In [11]:
df = pd.DataFrame(people)

In [12]:
df

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com

In [13]:
df.sort_values(by='last')

   first    last                  email
1  Jonny  Harode  jonnyharode@email.com
0    Har    Mesh      harmesh@gmail.com
3  Naina  Sharma  Nainasharma@gmail.com
2   Amit  Shukla   amitshukla@email.com

In [14]:
df.sort_values(by='last', ascending=False)

   first    last                  email
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com

In [15]:
df.sort_values(by=['last', 'first'])

   first    last                  email
1  Jonny  Harode  jonnyharode@email.com
0    Har    Mesh      harmesh@gmail.com
3  Naina  Sharma  Nainasharma@gmail.com
2   Amit  Shukla   amitshukla@email.com

In [16]:
df.sort_values(by=['last', 'first'], ascending=False)

   first    last                  email
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com

In [17]:
df.sort_values(by=['last', 'first'], ascending=[False, True])

   first    last                  email
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com

In [18]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [19]:
df

   first    last                  email
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com

In [20]:
df.sort_index()

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com

In [21]:

df['last'].sort_values()

1    Harode
0      Mesh
3    Sharma
2    Shukla
Name: last, dtype: object